Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
      + authorization_scopes = []
        id                   = "agm-pe0lv0x63k-raqvfu-GET"
      + request_models       = {}
      + request_parameters   = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.runs-filtering_terms has changed
  ~ resource "aws_api_gateway_method" "runs-filtering_terms" {
      + authorization_scopes = []
        id                   = "agm-pe0lv0x63k-mwmxsh-GET"
      + request_models       = {}
      + request_parameters   = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.runs-filtering_terms_post has changed
  ~ resource "aws_api_gateway_method" "runs-filtering_terms_post" {
      + authorization_scopes = []
        id                   = "agm-pe0lv0x63k-mwmxsh-POST"
      + request_models       = {}
      + request_parameters   = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.runs-id has changed
  ~ resource "aws_api_gateway_method" "runs-id" {
      + authorization_scopes = []
        id                   = "agm-pe0lv0x63k-1jwwt4-GET"
      + request_models       = {}
        # (10 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.runs-id-analyses has changed
  ~ resource "aws_api_gateway_method" "runs-id-analyses" {
      + authorization_scopes = []
        id                   = "agm-pe0lv0x63k-o2na61-GET"
      + request_models       = {}
        # (10 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.runs-id-analyses_post has changed
  ~ resource "aws_api_gateway_method" "runs-id-analyses_post" {
      + authorization_scopes = []
        id                   = "agm-pe0lv0x63k-o2na61-POST"
      + request_models       = {}
        # (10 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.runs-id-g_variants has changed
  ~ resource "aws_api_gateway_method" "runs-id-g_variants" {
      + authorization_scopes = []
        id                   = "agm-pe0lv0x63k-btfxiy-GET"
      + request_models       = {}
        # (10 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.runs-id-g_variants_post has changed
  ~ resource "aws_api_gateway_method" "runs-id-g_variants_post" {
      + authorization_scopes = []
        id                   = "agm-pe0lv0x63k-btfxiy-POST"
      + request_models       = {}
        # (10 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.runs-id_post has changed
  ~ resource "aws_api_gateway_method" "runs-id_post" {
      + authorization_scopes = []
        id                   = "agm-pe0lv0x63k-1jwwt4-POST"
      + request_models       = {}
        # (10 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.runs_post has changed
  ~ resource "aws_api_gateway_method" "runs_post" {
      + authorization_scopes = []
        id                   = "agm-pe0lv0x63k-raqvfu-POST"
      + request_models       = {}
      + request_parameters   = {}
        # (9 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_integration.results-get has changed
  ~ resource "aws_api_gateway_integration" "results-get" {
      + cache_key_parameters    = []
        id                      = "agi-cy0g8gkrzd-xbn14b-GET"
      + request_parameters      = {}
      + request_templates       = {}
        # (14 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_integration.results-options has changed
  ~ resource "aws_api_gateway_integration" "results-options" {
      + cache_key_parameters    = []
        id                      = "agi-cy0g8gkrzd-xbn14b-OPTIONS"
      + request_parameters      = {}
        # (15 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_integration.submit-options has changed
  ~ resource "aws_api_gateway_integration" "submit-options" {
      + cache_key_parameters    = []
        id                      = "agi-cy0g8gkrzd-mbuauq-OPTIONS"
      + request_parameters      = {}
        # (15 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_integration.submit-patch has changed
  ~ resource "aws_api_gateway_integration" "submit-patch" {
      + cache_key_parameters    = []
        id                      = "agi-cy0g8gkrzd-mbuauq-PATCH"
      + request_parameters      = {}
      + request_templates       = {}
        # (14 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_integration.submit-post has changed
  ~ resource "aws_api_gateway_integration" "submit-post" {
      + cache_key_parameters    = []
        id                      = "agi-cy0g8gkrzd-mbuauq-POST"
      + request_parameters      = {}
      + request_templates       = {}
        # (14 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_integration_response.results-get has changed
  ~ resource "aws_api_gateway_integration_response" "results-get" {
        id                  = "agir-cy0g8gkrzd-xbn14b-GET-200"
      + response_parameters = {}
        # (8 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_integration_response.submit-patch has changed
  ~ resource "aws_api_gateway_integration_response" "submit-patch" {
        id                  = "agir-cy0g8gkrzd-mbuauq-PATCH-200"
      + response_parameters = {}
        # (8 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_integration_response.submit-post has changed
  ~ resource "aws_api_gateway_integration_response" "submit-post" {
        id                  = "agir-cy0g8gkrzd-mbuauq-POST-200"
      + response_parameters = {}
        # (8 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_method.results-get has changed
  ~ resource "aws_api_gateway_method" "results-get" {
      + authorization_scopes = []
        id                   = "agm-cy0g8gkrzd-xbn14b-GET"
      + request_models       = {}
      + request_parameters   = {}
        # (9 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_method.results-options has changed
  ~ resource "aws_api_gateway_method" "results-options" {
      + authorization_scopes = []
        id                   = "agm-cy0g8gkrzd-xbn14b-OPTIONS"
      + request_models       = {}
      + request_parameters   = {}
        # (9 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_method.submit-options has changed
  ~ resource "aws_api_gateway_method" "submit-options" {
      + authorization_scopes = []
        id                   = "agm-cy0g8gkrzd-mbuauq-OPTIONS"
      + request_models       = {}
      + request_parameters   = {}
        # (9 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_method.submit-patch has changed
  ~ resource "aws_api_gateway_method" "submit-patch" {
      + authorization_scopes = []
        id                   = "agm-cy0g8gkrzd-mbuauq-PATCH"
      + request_models       = {}
      + request_parameters   = {}
        # (9 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_method.submit-post has changed
  ~ resource "aws_api_gateway_method" "submit-post" {
      + authorization_scopes = []
        id                   = "agm-cy0g8gkrzd-mbuauq-POST"
      + request_models       = {}
      + request_parameters   = {}
        # (9 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_integration.results-get has changed
  ~ resource "aws_api_gateway_integration" "results-get" {
      + cache_key_parameters    = []
        id                      = "agi-cy0g8gkrzd-8lebk5-GET"
      + request_parameters      = {}
      + request_templates       = {}
        # (14 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_integration.results-options has changed
  ~ resource "aws_api_gateway_integration" "results-options" {
      + cache_key_parameters    = []
        id                      = "agi-cy0g8gkrzd-8lebk5-OPTIONS"
      + request_parameters      = {}
        # (15 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_integration.submit-options has changed
  ~ resource "aws_api_gateway_integration" "submit-options" {
      + cache_key_parameters    = []
        id                      = "agi-cy0g8gkrzd-g14z9q-OPTIONS"
      + request_parameters      = {}
        # (15 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_integration.submit-patch has changed
  ~ resource "aws_api_gateway_integration" "submit-patch" {
      + cache_key_parameters    = []
        id                      = "agi-cy0g8gkrzd-g14z9q-PATCH"
      + request_parameters      = {}
      + request_templates       = {}
        # (14 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_integration.submit-post has changed
  ~ resource "aws_api_gateway_integration" "submit-post" {
      + cache_key_parameters    = []
        id                      = "agi-cy0g8gkrzd-g14z9q-POST"
      + request_parameters      = {}
      + request_templates       = {}
        # (14 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_integration_response.results-get has changed
  ~ resource "aws_api_gateway_integration_response" "results-get" {
        id                  = "agir-cy0g8gkrzd-8lebk5-GET-200"
      + response_parameters = {}
        # (8 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_integration_response.submit-patch has changed
  ~ resource "aws_api_gateway_integration_response" "submit-patch" {
        id                  = "agir-cy0g8gkrzd-g14z9q-PATCH-200"
      + response_parameters = {}
        # (8 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_integration_response.submit-post has changed
  ~ resource "aws_api_gateway_integration_response" "submit-post" {
        id                  = "agir-cy0g8gkrzd-g14z9q-POST-200"
      + response_parameters = {}
        # (8 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_method.results-get has changed
  ~ resource "aws_api_gateway_method" "results-get" {
      + authorization_scopes = []
        id                   = "agm-cy0g8gkrzd-8lebk5-GET"
      + request_models       = {}
      + request_parameters   = {}
        # (9 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_method.results-options has changed
  ~ resource "aws_api_gateway_method" "results-options" {
      + authorization_scopes = []
        id                   = "agm-cy0g8gkrzd-8lebk5-OPTIONS"
      + request_models       = {}
      + request_parameters   = {}
        # (9 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_method.submit-options has changed
  ~ resource "aws_api_gateway_method" "submit-options" {
      + authorization_scopes = []
        id                   = "agm-cy0g8gkrzd-g14z9q-OPTIONS"
      + request_models       = {}
      + request_parameters   = {}
        # (9 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_method.submit-patch has changed
  ~ resource "aws_api_gateway_method" "submit-patch" {
      + authorization_scopes = []
        id                   = "agm-cy0g8gkrzd-g14z9q-PATCH"
      + request_models       = {}
      + request_parameters   = {}
        # (9 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_method.submit-post has changed
  ~ resource "aws_api_gateway_method" "submit-post" {
      + authorization_scopes = []
        id                   = "agm-cy0g8gkrzd-g14z9q-POST"
      + request_models       = {}
      + request_parameters   = {}
        # (9 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.cognito.aws_cognito_user.admin will be created
  + resource "aws_cognito_user" "admin" {
      + attributes            = {
          + "email"          = "admin@example.com"
          + "email_verified" = "true"
          + "family_name"    = "Admin"
          + "given_name"     = "Admin"
          + "terraform"      = "true"
        }
      + creation_date         = (known after apply)
      + enabled               = true
      + id                    = (known after apply)
      + last_modified_date    = (known after apply)
      + mfa_setting_list      = (known after apply)
      + password              = (sensitive value)
      + preferred_mfa_setting = (known after apply)
      + region                = "ap-southeast-3"
      + status                = (known after apply)
      + sub                   = (known after apply)
      + user_pool_id          = "ap-southeast-3_wrRXa0JGY"
      + username              = "admin@example.com"
    }

  # module.cognito.aws_cognito_user.guest will be created
  + resource "aws_cognito_user" "guest" {
      + attributes            = {
          + "email"          = "guest@example.com"
          + "email_verified" = "true"
          + "family_name"    = "Guest"
          + "given_name"     = "Guest"
          + "terraform"      = "true"
        }
      + creation_date         = (known after apply)
      + enabled               = true
      + id                    = (known after apply)
      + last_modified_date    = (known after apply)
      + mfa_setting_list      = (known after apply)
      + password              = (sensitive value)
      + preferred_mfa_setting = (known after apply)
      + region                = "ap-southeast-3"
      + status                = (known after apply)
      + sub                   = (known after apply)
      + user_pool_id          = "ap-southeast-3_wrRXa0JGY"
      + username              = "guest@example.com"
    }

  # module.cognito.aws_cognito_user_in_group.admin_in_admin_group will be created
  + resource "aws_cognito_user_in_group" "admin_in_admin_group" {
      + group_name   = "administrators"
      + id           = (known after apply)
      + region       = "ap-southeast-3"
      + user_pool_id = "ap-southeast-3_wrRXa0JGY"
      + username     = "admin@example.com"
    }

  # module.pgxflow[0].aws_api_gateway_deployment.PgxApi must be replaced
+/- resource "aws_api_gateway_deployment" "PgxApi" {
      ~ created_date = "2025-06-19T02:51:29Z" -> (known after apply)
      ~ id           = "vb5d5k" -> (known after apply)
      ~ triggers     = { # forces replacement
          ~ "redeployment" = "57212f83f0f024ae12a042d3bbe6de28eaa5b320" -> "628d5586928ab5ffd2c782ac476ff7fd7afcdc5a"
        }
        # (3 unchanged attributes hidden)
    }

  # module.pgxflow[0].aws_api_gateway_stage.PgxApi will be updated in-place
  ~ resource "aws_api_gateway_stage" "PgxApi" {
      ~ deployment_id         = "vb5d5k" -> (known after apply)
        id                    = "ags-cy0g8gkrzd-prod"
        tags                  = {}
        # (15 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_deployment.BeaconApi must be replaced
+/- resource "aws_api_gateway_deployment" "BeaconApi" {
      ~ created_date = "2025-06-19T02:50:58Z" -> (known after apply)
      ~ id           = "4q4l4q" -> (known after apply)
      ~ triggers     = { # forces replacement
          ~ "redeployment" = "510436a27ab9c009d7df6157aa29d07341a6ed7a" -> "f72baf25dd0be218adb630a8277b6bb84400b1d4"
        }
        # (3 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_stage.BeaconApi will be updated in-place
  ~ resource "aws_api_gateway_stage" "BeaconApi" {
      ~ deployment_id         = "4q4l4q" -> (known after apply)
        id                    = "ags-pe0lv0x63k-prod"
        tags                  = {}
        # (15 unchanged attributes hidden)
    }

  # module.webgui.aws_s3_object.version will be updated in-place
  ~ resource "aws_s3_object" "version" {
      ~ content                       = "v0.13.7-alpha-11-g45a5057" -> "v0.13.7-alpha-12-gc87e6e1"
        id                            = "version.txt"
        tags                          = {}
      + version_id                    = (known after apply)
        # (25 unchanged attributes hidden)
    }

  # module.webgui.null_resource.cloudfront-invalidate must be replaced
-/+ resource "null_resource" "cloudfront-invalidate" {
      ~ id       = "456028936625806955" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "compiled_code_hash" = "98516df9bee46a79db5bf689b652c7b17daeeb6c" -> "7f6d1dc7a4c9e2337517c1e1a35a29d073425bae"
        }
    }

  # module.webgui.null_resource.s3-upload must be replaced
-/+ resource "null_resource" "s3-upload" {
      ~ id       = "4772541498151650759" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "compiled_code_hash" = "98516df9bee46a79db5bf689b652c7b17daeeb6c" -> "7f6d1dc7a4c9e2337517c1e1a35a29d073425bae"
            # (1 unchanged element hidden)
        }
    }

  # module.webgui.terraform_data.cloudfront-version-invalidate must be replaced
-/+ resource "terraform_data" "cloudfront-version-invalidate" {
      ~ id               = "39552c18-a373-6b39-aaef-8804d36b250b" -> (known after apply)
      ~ triggers_replace = [
          ~ "v0.13.7-alpha-11-g45a5057" -> "v0.13.7-alpha-12-gc87e6e1",
        ]
    }

  # module.cognito.module.lambda-customMessageLambdaTrigger.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2700050535487884804" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750300212735586000" -> "1750303041834291000"
            # (1 unchanged element hidden)
        }
    }

  # module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2694846795068710694" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750300213779041000" -> "1750303040773390000"
            # (1 unchanged element hidden)
        }
    }

  # module.cognito.module.lambda-sendClinicJobEmail.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4813950358422478616" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750300212378342000" -> "1750303040150924000"
            # (1 unchanged element hidden)
        }
    }

  # module.cognito.module.lambda-sendRegistrationEmail.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4139857140156673874" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750300213261214000" -> "1750303041670317800"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.python_libraries_layer.aws_lambda_layer_version.this[0] must be replaced
+/- resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:438465168484:layer:pgxflow_backend_python_libraries_layer:1" -> (known after apply)
      ~ code_sha256                 = "+L8SolGFpnaEB8OalaPBBRv/TTcCX+K7wXOq9kE1Hgg=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-06-19T02:37:23.942+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:438465168484:layer:pgxflow_backend_python_libraries_layer:1" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:438465168484:layer:pgxflow_backend_python_libraries_layer" -> (known after apply)
      ~ s3_key                      = "builds/cd1fb28f2c60c471e4a371aa1e6a5536494d9d48d8b115c51e92cfdae67c8a99.zip" -> "builds/6f4cf68516abc051e67e5cb23463a2ccd3bead59fb820968d7d663550d6a6f86.zip" # forces replacement
      + s3_object_version           = (known after apply) # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      ~ source_code_size            = 172647 -> (known after apply)
      ~ version                     = "1" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.python_libraries_layer.aws_s3_object.lambda_package[0] must be replaced
+/- resource "aws_s3_object" "lambda_package" {
      ~ arn                           = "arn:aws:s3:::pgxflow-backend-layers-20250619023037267500000001/builds/cd1fb28f2c60c471e4a371aa1e6a5536494d9d48d8b115c51e92cfdae67c8a99.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "application/octet-stream" -> (known after apply)
      ~ etag                          = "6c0a14e631054921d1fbf56af2172111" -> (known after apply)
      ~ id                            = "builds/cd1fb28f2c60c471e4a371aa1e6a5536494d9d48d8b115c51e92cfdae67c8a99.zip" -> (known after apply)
      ~ key                           = "builds/cd1fb28f2c60c471e4a371aa1e6a5536494d9d48d8b115c51e92cfdae67c8a99.zip" -> "builds/6f4cf68516abc051e67e5cb23463a2ccd3bead59fb820968d7d663550d6a6f86.zip" # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = "builds/cd1fb28f2c60c471e4a371aa1e6a5536494d9d48d8b115c51e92cfdae67c8a99.zip" -> "builds/6f4cf68516abc051e67e5cb23463a2ccd3bead59fb820968d7d663550d6a6f86.zip"
      - tags                          = {} -> null
      ~ tags_all                      = {} -> (known after apply)
      + version_id                    = (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.python_libraries_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "pgxflow/layers/python_libraries/",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/6f4cf68516abc051e67e5cb23463a2ccd3bead59fb820968d7d663550d6a6f86.zip"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/6f4cf68516abc051e67e5cb23463a2ccd3bead59fb820968d7d663550d6a6f86.plan.json"
      + id                   = (known after apply)
    }

  # module.pgxflow[0].module.python_libraries_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "695903073955692748" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/cd1fb28f2c60c471e4a371aa1e6a5536494d9d48d8b115c51e92cfdae67c8a99.zip" -> "builds/6f4cf68516abc051e67e5cb23463a2ccd3bead59fb820968d7d663550d6a6f86.zip"
          ~ "timestamp" = "1750300639330858000" -> "1750303059591012000"
        }
    }

  # module.pgxflow[0].module.python_modules_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7405780631018158752" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750300213051785000" -> "1750303040526518200"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-admin.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-admin"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_libraries_layer:7",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_modules_layer:5",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-admin.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7437137673356702548" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750300213169315000" -> "1750303040739684200"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-data-portal.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-dataPortal"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_libraries_layer:7",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_modules_layer:5",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-data-portal.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5681270177510769544" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750300212377827000" -> "1750303041664615000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-deidentifyFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-deidentifyFiles"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_libraries_layer:7",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_modules_layer:5",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_binaries_layer:9",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "428395623648074612" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750300213769200000" -> "1750303041866188000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-generateCohortVCfs.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-generateCohortVCfs"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_libraries_layer:7",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_modules_layer:5",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_binaries_layer:9",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-generateCohortVCfs.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4941005638243018095" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750300212442131000" -> "1750303041035791000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-generateReports.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7898002292486652474" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750300211634806000" -> "1750303040782479000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getAnalyses.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getAnalyses"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_libraries_layer:7",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_modules_layer:5",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5570787560365016711" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750300212276084800" -> "1750303041531964000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getBiosamples.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getBiosamples"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_libraries_layer:7",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_modules_layer:5",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7817725181243332357" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750300213665577800" -> "1750303040358648000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getConfiguration.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getConfiguration"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_libraries_layer:7",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_modules_layer:5",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getConfiguration.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7967290707199585218" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750300212772765000" -> "1750303041359231000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getDatasets.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getDatasets"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_libraries_layer:7",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_modules_layer:5",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getDatasets.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "336307117043151547" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750300212680883800" -> "1750303040472482000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getEntryTypes.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getEntryTypes"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_libraries_layer:7",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_modules_layer:5",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1231062824382790311" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750300211335020000" -> "1750303039863487000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getFilteringTerms.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getFilteringTerms"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_libraries_layer:7",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_modules_layer:5",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4870541800078495713" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750300213245112000" -> "1750303039719305000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getGenomicVariants.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getGenomicVariants"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_libraries_layer:7",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_modules_layer:5",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5408197854940249972" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750300212720436000" -> "1750303039865565000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getIndividuals.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getIndividuals"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_libraries_layer:7",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_modules_layer:5",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7655693547730884748" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750300213178819800" -> "1750303041044466000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getInfo.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getInfo"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_libraries_layer:7",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_modules_layer:5",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getInfo.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8953036514929914265" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750300213232810000" -> "1750303041444334000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getMap.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getMap"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_libraries_layer:7",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_modules_layer:5",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getMap.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8092755982344235242" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750300212647770000" -> "1750303040649736000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getProjects.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getProjects"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_libraries_layer:7",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_modules_layer:5",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getProjects.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1290608943353002825" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750300212428330800" -> "1750303041152788000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getRuns.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getRuns"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_libraries_layer:7",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_modules_layer:5",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getRuns.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "498935544522382063" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750300213641574000" -> "1750303040970796200"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-indexer.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-indexer"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_libraries_layer:7",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_modules_layer:5",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-indexer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "9065059751015139106" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750300213820609000" -> "1750303039864424000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-performQuery.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-performQuery"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_binaries_layer:9",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_libraries_layer:7",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_modules_layer:5",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-performQuery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2915305304470768037" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750300211738847000" -> "1750303039857167000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-splitQuery.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-splitQuery"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_libraries_layer:7",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_modules_layer:5",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-splitQuery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1950578876444559891" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750300213275596000" -> "1750303041026318000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-updateFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-updateFiles"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_binaries_layer:9",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_libraries_layer:7",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_modules_layer:5",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-updateFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8217383638540509324" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750300211438754000" -> "1750303040232632000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.python_libraries_layer.aws_lambda_layer_version.this[0] must be replaced
+/- resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_libraries_layer:7" -> (known after apply)
      ~ code_sha256                 = "XFHmNgmhdnqOlynetOZqS/AC4sy+vF96XtvqJrm05QY=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-06-19T02:48:59.539+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_libraries_layer:7" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_libraries_layer" -> (known after apply)
      ~ s3_key                      = "builds/39b0ceba9439713c5c07b8fc1c05101d3f100159e1a5092a19fb6e1e04792304.zip" -> "builds/7beefda982f5be371382d0ff4063670f0aeff8f7b2fa9c29f46b42a0b3a901ba.zip" # forces replacement
      + s3_object_version           = (known after apply) # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      ~ source_code_size            = 23696010 -> (known after apply)
      ~ version                     = "7" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_libraries_layer.aws_s3_object.lambda_package[0] must be replaced
+/- resource "aws_s3_object" "lambda_package" {
      ~ arn                           = "arn:aws:s3:::gaspi-lambda-layers-20250619023050292900000004/builds/39b0ceba9439713c5c07b8fc1c05101d3f100159e1a5092a19fb6e1e04792304.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "binary/octet-stream" -> (known after apply)
      ~ etag                          = "e4b811492aaca54838f466ce4cb29602-5" -> (known after apply)
      ~ id                            = "builds/39b0ceba9439713c5c07b8fc1c05101d3f100159e1a5092a19fb6e1e04792304.zip" -> (known after apply)
      ~ key                           = "builds/39b0ceba9439713c5c07b8fc1c05101d3f100159e1a5092a19fb6e1e04792304.zip" -> "builds/7beefda982f5be371382d0ff4063670f0aeff8f7b2fa9c29f46b42a0b3a901ba.zip" # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = "builds/39b0ceba9439713c5c07b8fc1c05101d3f100159e1a5092a19fb6e1e04792304.zip" -> "builds/7beefda982f5be371382d0ff4063670f0aeff8f7b2fa9c29f46b42a0b3a901ba.zip"
      - tags                          = {} -> null
      + version_id                    = (known after apply)
        # (14 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_libraries_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/layers/python_libraries/",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/7beefda982f5be371382d0ff4063670f0aeff8f7b2fa9c29f46b42a0b3a901ba.zip"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/7beefda982f5be371382d0ff4063670f0aeff8f7b2fa9c29f46b42a0b3a901ba.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.python_libraries_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2616520953364042401" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/39b0ceba9439713c5c07b8fc1c05101d3f100159e1a5092a19fb6e1e04792304.zip" -> "builds/7beefda982f5be371382d0ff4063670f0aeff8f7b2fa9c29f46b42a0b3a901ba.zip"
          ~ "timestamp" = "1750301329559400000" -> "1750303059868513200"
        }
    }

  # module.sbeacon.module.python_modules_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7527274506783455722" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750300212846689000" -> "1750303041171045000"
            # (1 unchanged element hidden)
        }
    }

  # module.security.module.lambda-sendSecurityAlert.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6286544609707883523" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750300213676580000" -> "1750303041534251000"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-dbsnp.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8372722209999866716" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750300211752601000" -> "1750303040348523000"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-getResultsURL.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "9094693279551011946" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750300211684200000" -> "1750303040585089000"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-gnomad.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5774305104271963983" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750300212271827000" -> "1750303040239092200"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-initLookup.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5138863434533339837" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750300213055250000" -> "1750303039965954000"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-lookup.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5682274019171982664" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750300211431375000" -> "1750303041484648000"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-sendJobEmail.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7764746219925180592" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750300211536056000" -> "1750303039940229000"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-updateReferenceFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5060456204089939615" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750300213219245000" -> "1750303041523186000"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-getResultsURL.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "74080681236050336" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750300213924326800" -> "1750303040958360000"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-gnomad.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "3016171251340302485" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750300212140567000" -> "1750303041958792000"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-initPharmcat.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5800146309871923319" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750300211949599000" -> "1750303041422363000"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-postprocessor.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-postprocessor"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:pgxflow_backend_python_modules_layer:1",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:pgxflow_backend_python_libraries_layer:1",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:pgxflow_backend_binaries_layer:1",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-postprocessor.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7025562325096826746" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750300213549415200" -> "1750303040758142000"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-sendJobEmail.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2331240722775444625" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750300213459579000" -> "1750303041164897000"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-updateReferenceFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6025664857401438406" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750300212248422000" -> "1750303040438839000"
            # (1 unchanged element hidden)
        }
    }

Plan: 57 to add, 24 to change, 52 to destroy.
╷
│ Warning: Deprecated attribute
│ 
│   on .terraform/modules/cognito.lambda-customMessageLambdaTrigger/outputs.tf line 9, in output "lambda_function_arn_static":
│    9:   value       = local.create && var.create_function && !var.create_layer ? "arn:${data.aws_partition.current.partition}:lambda:${data.aws_region.current.name}:${data.aws_caller_identity.current.account_id}:function:${var.function_name}" : ""
│ 
│ The attribute "name" is deprecated. Refer to the provider documentation for
│ details.
│ 
│ (and 109 more similar warnings elsewhere)
╵

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: uat01-plan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "uat01-plan.out"
✅ Terraform plan created successfully: uat01-plan.out
ℹ️  Plan summary:

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.pgxflow[0].aws_api_gateway_integration.vcfstats-options has changed
  ~ resource "aws_api_gateway_integration" "vcfstats-options" {
      + cache_key_parameters    = []
        id                      = "agi-cy0g8gkrzd-b4574d-OPTIONS"
      + request_parameters      = {}
        # (15 unchanged attributes hidden)
    }

  # module.pgxflow[0].aws_api_gateway_integration.vcfstats-patch has changed
  ~ resource "aws_api_gateway_integration" "vcfstats-patch" {
      + cache_key_parameters    = []
        id                      = "agi-cy0g8gkrzd-b4574d-PATCH"
      + request_parameters      = {}
      + request_templates       = {}
ℹ️  Cleaning up sensitive files
✅ Cleanup completed
✅ ============================================================
✅ Atlantis plan completed successfully for uat01!

Thank you for using Atlantis Schema Deploy
© June, 2025 GXC Consortium
✅ Main execution completed successfully
ℹ️  Cleaning up sensitive files
✅ Cleanup completed
✅ Script completed successfully
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p gxc-uat01
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis-gxc.xapiens.id/lock?id=GSI-Xapiens-CSIRO%252FBGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p gxc-uat01
  ```

**Note: Objects have changed outside of Terraform**
Plan: 57 to add, 24 to change, 52 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```